app/controllers/make_menu_controller.rb

INSERT INTO "food_selecteds" ("food_num1", "food_num2", "food_num3", "food_num4", "food_num5", "food_num6", "food_num7", "food_num8", "food_num9", "food_num10", "food_num11", "food_num12", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def resist_food
    @food_selected = FoodSelected.new(food_select_params)
    @food_selected.save

SELECT "food_selecteds".* FROM "food_selecteds"
---
  def show
    @food_selecteds = FoodSelected.all